import React from "react";
import { Button, Card, CardBody, CardTitle } from "reactstrap";
import Link from "next/link";
import { Container } from "reactstrap";
import { withRouter } from "next/router";

export default class DataPolicy extends React.Component {
  render() {
    return (
      <Container
        style={{
          maxWidth: "100%",
          paddingLeft: 0,
          paddingRight: 0,
          backgroundColor: "#fff"
        }}
      >
        <nav
          className="navbar navbar-expand-md navbar-light d-flex"
          style={{
            backgroundColor: "#171e4a",
            width: "100%",
            padding: "15px",
            marginBottom: "40px"
          }}
        >
          <div
            className="pull-left-term"
            style={{ width: "100%", marginLeft: "20px" }}
          >
            <a className="navbar-brand" href="#">
              <img src="/static/images/icon/icon_wh.png" alt="" width="130" />
            </a>
          </div>
          <div
            className="login-btn pull-right-term"
            style={{
              display: "flex",
              alignItems: "center",
              justifyContent: "center",
              width: "30%"
            }}
          >
            <Link href="/login">
              <a
                className="btn btn-primary-term"
                style={{
                  borderColor: "#fff",
                  backgroundColor: "#171e4a",
                  marginRight: 15,
                  borderRadius: 20,
                  fontFamily: "Cloud",
                  padding: "7px 30px",
                  color: '#fff'
                }}
              >
                เข้าสู่ระบบ
              </a>
            </Link>

            <Link href="/register">
              <a
                className="btn btn-primary-term"
                href="#"
                style={{
                  borderColor: "#fff",
                  backgroundColor: "#171e4a",
                  borderRadius: 20,
                  fontFamily: "Cloud",
                  padding: "7px 30px",
                  color: '#fff'
                }}
              >
                สมัครสมาชิก
              </a>
            </Link>
          </div>
        </nav>

        <div
          style={{ display: "flex", justifyContent: "center", width: "100%" }}
        >
          <div className="row" style={{maxWidth: '70%'}}>
            <div
              className="col-md-8-term col-sm-offset-2"
            >
              <h4 style={{ textAlign: "center", fontWeight: 600 }}>
                นโยบายความเป็นส่วนตัว ข้อกำหนด และ เงื่อนไขตามกฎหมายของ Website
              </h4>

              <p>
                <span />
              </p>

              <p>
                <span>
                  โดยการเชื่อมโยง เข้าถึง เรียกข้อมูล การซื้อขายสินค้า
                  และการบริการจาก Website นี้ (" Website")
                  ท่านตกลงจะผูกพันและยอมรับโดยไม่มีข้อสงวนหรือเงื่อนไขใด ๆ
                  ซึ่งนโยบายความเป็นส่วนตัวและข้อกำหนดและเงื่อนไขตามกฎหมายในการใช้ข้อมูล
                  และการใช้บริการของเราผ่าน Website ดังนั้น
                  จึงขอให้ท่านอ่านข้อความของนโยบายความเป็นส่วนตัวและข้อกำหนดและเงื่อนไขตามกฎหมายอย่างระมัดระวังก่อนใช้
                  Website นี้
                  หากท่านไม่ตกลงผูกพันหรือยอมรับในนโยบายความเป็นส่วนตัวและข้อกำหนดและเงื่อนไขตามกฎหมายของเรา
                  กรุณาอย่าใช้ Website นี้
                </span>
              </p>
              <ul>
                <li style={{ listStyle: "inherit" }}>
                  <span>นโยบายความเป็นส่วนตัว </span>
                </li>
                <li style={{ listStyle: "inherit" }}>
                  <span>ข้อกำหนดและเงื่อนไขตามกฎหมาย </span>
                </li>
              </ul>

              <p>
                <span />
              </p>

              <p>
                <h4 style={{fontWeight: 600 }}>นโยบายความเป็นส่วนตัว</h4>
              </p>

              <p>
                <span>
                  นโยบายความเป็นส่วนตัวนี้จะอธิบายถึงประเภทของข้อมูลที่ท่านสามารถเข้าถึง
                  หรือรวบรวมในระหว่างที่ท่านเข้ามาเยี่ยมชม Website
                  และเพื่อวัตถุประสงค์ของเราในการใช้ข้อมูลดังกล่าว
                </span>
              </p>

              <p>
                <span>
                  บริษัท ........... จำกัด (บริษัท)
                  เคารพในความเป็นส่วนตัวของทุกท่านที่แวะชม Website ของเรา
                  เราจะไม่ทำการรวบรวมข้อมูลบ่งชี้ตัวบุคคลเกี่ยวกับตัวท่าน
                  เว้นแต่ท่านจะจัดส่งข้อมูลให้กับทางเราโดยสมัครใจ อย่างไรก็ตาม
                  เราอาจขอข้อมูลของท่านจากแบบฟอร์มใบสมัครใช้บริการของเรา
                  ซึ่งท่านต้องกรอกข้อมูลให้เราดังนี้คือ (ที่อยู่ในการติดต่อ
                  หมายเลขบัตรประชาชน หมายเลขบัตรเครดิต
                  และรายละเอียดทางการเงินอื่น ๆ) ทั้งนี้ คำว่า
                  "ข้อมูลบ่งชี้ตัวบุคคล" (ต่อไปนี้เรียกว่า "ข้อมูลส่วนบุคคล")
                  เรา หมายถึง ชื่อ ที่อยู่ เพศ อีเมลล์ เบอร์โทรศัพท์ สถานภาพสมรส
                  อายุ วันเดือนปีเกิด ระดับการศึกษา รายได้
                  ข้อมูลการใช้บริการของท่าน
                  เราจะให้เคารพในความเป็นส่วนตัวของท่าน และจะไม่ทำการขาย ให้เช่า
                  หรือดำเนินการประการใด ทำการเปิดเผย
                  หรือทำให้ปรากฏซึ่งข้อมูลส่วนบุคคลของท่านเพื่อวัตถุประสงค์ในทางการค้า
                  หรือเพื่อประโยชน์ใด ๆ โดยไม่ได้รับความยินยอมจากท่าน
                  เว้นแต่เพื่อวัตถุประสงค์ดังต่อไปนี้
                </span>
              </p>
              <ol>
                <li>
                  <span>
                    เพื่อแนะนำและเลือกสินค้า
                    หรือบริการให้สอดคล้องให้ได้ดีที่สุดกับการศึกษาของท่าน
                    และความต้องการทั่วไป
                  </span>
                </li>
                <li>
                  <span>
                    เพื่อทำการวิเคราะห์ด้านการตลาดและการวิจัยเพื่อให้เราสามารถทำการพัฒนาสินค้าหรือบริการของเรา
                  </span>
                </li>
                <li>
                  <span>
                    เพื่อปรับปรุง Website ให้เข้าถึงลุกค้ากลุ่มเป้าหมาย{" "}
                  </span>
                </li>
                <li>
                  <span>
                    เพื่อทำการวิเคราะห์ทางสถิติเพื่อให้เราสามารถเข้าใจถึงความต้องการของท่าน
                    และ/หรือ
                    ความกังวลทั่วไปและแนวโน้มของการใช้บริการทางการศึกษาได้ดีขึ้น
                    และ{" "}
                  </span>
                </li>
                <li>
                  <span>
                    จัดส่งสิ่งพิมพ์ เอกสารตอบโต้ การให้ข้อมูลทางอีเมลล์
                    ข้อมูลใหม่ หรือการแจ้งข่าวสารให้แก่ท่าน
                  </span>
                </li>
              </ol>
              <p>
                <span>
                  ทั้งนี้
                  ข้อผูกพันข้างต้นจะไม่นำมาใช้หรือจะยุติการใช้ในกรณีที่ข้อมูลดังกล่าว
                  (ก) เป็นที่ล่วงรู้ของสาธารณะโดยมิได้เป็นการเปิดเผยข้อมูลโดยเรา
                  (ข)
                  เราได้ทราบถึงข้อมูลดังกล่าวก่อนที่ท่านเปิดเผยข้อมูลให้กับเรา
                  หรือ (ค)
                  เรามีหน้าที่ต้องทำการเปิดเผยข้อมูลดังกล่าวให้แก่หน่วยงานของศาล
                  หน่วยงานของรัฐ
                  หรือหน่วยงานที่มีอำนาจกำกับดูแลหรือตามกฎหมายหรือกฎระเบียบของประเทศไทยหรือของประเทศอื่น
                  ๆ
                </span>
              </p>

              <p>
                <span>
                  โปรดรับทราบว่านโยบายข้อมูลส่วนตัวอาจมีการปรับเปลี่ยน
                  และเปลี่ยนแปลงต่าง ๆ ซึ่งจะได้แสดงให้ท่านเห็นในหน้าของ Website
                  ที่เกี่ยวข้อง
                </span>
              </p>

              <p>
                <span>
                  ถ้าในกรณีที่ท่านเลือกที่จะเข้าเป็นสมาชิกของ VEOonline
                  เราอาจใช้อีเมลล์ของท่านเพื่อติดต่อให้ท่านทราบเกี่ยวกับรายการส่งเสริมการให้บริการ
                  รายการส่งเสริมการขาย การแข่งขัน กิจกรรม
                  สินค้าหรือสื่อการเรียนการสอนที่ออกวางตลาดใหม่
                  เราจะไม่ใช้ข้อมูลส่วนตัวของท่านเพื่อวัตถุประสงค์อื่น
                  เว้นแต่ได้รับความยินยอมจากท่านเป็นการล่วงหน้า ยกเว้น
                  ในส่วนที่เราใช้ตัวแทนบุคคลภายนอกเป็นผู้ดำเนินการให้
                  ตัวอย่างเช่น การดำเนินการเรื่องบัตรเครดิต การจัดส่งสินค้า
                  การดำเนินการเกี่ยวกับการสั่งของ หรือ การวิเคราะห์ข้อมูล
                  ในกรณีเช่นนี้ เราจะนำข้อมูลไปใช้เฉพาะข้อมูลที่จำเป็นเท่านั้น
                  ทั้งนี้ท่านสามารถบอกเลิกการเป็นสมาชิกของท่านโดยส่งอีเมลล์ไปที่{" "}
                </span>
                <span className="c4 c10">info@Crewhitz.com</span>
              </p>

              <p>
                <span>
                  หากท่านไม่ประสงค์ที่จะลงทะเบียนและไม่ประสงค์ที่จะรับข้อมูลข่าวสารจาก
                  Website ท่านไม่จำเป็นต้องแจ้งข้อมูลที่เกี่ยวกับตัวท่านให้แก่
                  Website ในกรณีที่ท่านส่งข้อมูลให้กับเรา
                  แต่ท่านไม่ประสงค์จะให้เราใช้ข้อมูลของท่านต่อไปเพื่อวัตถุประสงค์ข้างต้น
                  ท่านสามารถเขียนจดหมายถึงเราตามที่อยู่ดังต่อไปนี้
                  และจ่าหน้าถึงฝ่ายลูกค้าสัมพันธ์ บริษัท ........ จำกัด ......{" "}
                </span>
                <span className="c6 c12">09x-xxx-xxxx</span>
                <span>
                  {" "}
                  เราจะดำเนินการตามสมควรเพื่อลบข้อมูลของท่านจากบันทึกของเรา
                </span>
              </p>

              <p>
                <span>
                  เราขอแนะนำให้เด็กและเยาวชนที่อายุต่ำกว่า 18 ปี
                  ควรได้รับอนุญาตจากบิดา มารดา
                  หรือผู้ปกครองก่อนที่จะจัดส่งข้อมูลส่วนตัวให้กับทาง Website
                </span>
              </p>

              <p>
                <span>
                  นโยบายนี้อาจมีการเปลี่ยนแปลงแก้ไขเป็นครั้งคราวตามดุลยพินิจฝ่ายเดียวของบริษัท
                  ไวส์ คิงดอม จำกัด
                </span>
              </p>

              <p>
                <span />
              </p>

              <p>
                <h4 style={{fontWeight: 600 }}>ข้อกำหนดและเงื่อนไขตามกฎหมาย</h4>
              </p>

              <p>
                <span>
                  การที่ท่านเข้าถึงและใช้ Website
                  นี้จะอยู่ภายใต้ข้อกำหนดและเงื่อนไขดังต่อไปนี้
                  ("ข้อกำหนดและเงื่อนไข") และกฎหมายที่เกี่ยวข้อง
                </span>
              </p>

              <p>
                <span>
                  Website
                  นี้มีไว้เพื่อใช้เป็นการส่วนตัวและเพื่อการให้บริการทางการศึกษาของท่าน
                  นอกจากจะระบุไว้เป็นอื่นแล้ว ข้อมูล
                  หรือสาระที่ประกอบขึ้นเป็นเนื้อหาของ Website
                  มีไว้เพื่อให้ข้อมูลเกี่ยวกับเราสินค้า และบริการทางการศึกษา
                  ข้อมูล สาระ หรือเนื้อหาบน Website นั้น ให้ไว้ตามที่
                  "เป็นอยู่จริง"
                  เราไม่ได้ให้คำรับรองหรือคำรับประกันไม่ว่าโดยชัดแจ้งหรือโดยนัยเกี่ยวกับข้อมูล
                  สาระ หรือเนื้อหาบน Website ว่ามีความถูกต้อง ความครบถ้วน
                  หรือความเหมาะสม เพื่อวัตถุประสงค์ใดเป็นการเฉพาะและ
                  เราไม่ได้ให้คำรับรองหรือคำรับประกันว่าสินค้าทั้งหมดใน Website
                  เป็นสินค้าที่เหมาะสม และ/หรือ หาซื้อได้ทุกแห่งเพื่อการใช้สอย
                </span>
              </p>

              <p>
                <span>
                  บรรดา ชื่อ โลโก้ และเครื่องหมายบน Website นี้เป็นของเรา
                  หรือเราได้รับอนุญาตโดยชอบ
                  ในสถานที่ที่เราทำการขายสินค้าหรือให้บริการที่ใช้เครื่องหมายการค้า{" "}
                </span>
                <span> Crewhitz, Crewhitz.co</span>
                <span>
                  ทั้งนี้ การดัดแปลง การใช้ ชื่อ โลโก้ และเครื่องหมายการค้า
                  หรือการดัดแปลง การแก้ไข การส่ง การผลิตสำเนา การบันทึก การแสกน
                  หรือการใช้ข้อความ รูปภาพ ข้อมูล เนื้อหา หรือสาระบน Website
                  ไม่ว่าเพื่อการใดๆ หรือในรูปแบบใด ๆ หรือโดยเครื่องมือใด ๆ
                  นอกจากระบุไว้ในข้อกำหนดและเงื่อนไขนี้ หรือเป็นไปตามข้อความใน
                  Website ห้ามกระทำโดยเด็ดขาด
                  ถ้าไม่ได้รับความยินยอมโดยแจ้งชัดเป็นหนังสือจากเรา
                </span>
              </p>

              <p>
                <span>
                  ไม่มีข้อความใด ๆ ใน Website
                  นี้ที่ถือว่าเป็นการอนุญาตหรือให้สิทธิในการใช้เครื่องหมายการค้าที่แสดงไว้บน
                  Website
                  หากปราศจากหนังสืออนุญาตที่ชัดเจนจากเจ้าของที่เกี่ยวข้อง
                  หรือบุคคลภายนอกที่เป็นเจ้าของ
                </span>
              </p>

              <p>
                <span>
                  นอกจากระบุเป็นอย่างอื่นไว้อย่างชัดแจ้ง
                  ข้อมูลและสาระที่ท่านจัดให้มา และ/หรือ ส่งมอบมายัง Website
                  จะได้รับการปฏิบัติตามนโยบายข้อมูลส่วนบุคคล
                  ท่านจะเป็นผู้รับผิดชอบแต่เพียงผู้เดียวสำหรับข้อมูลและเนื้อหา
                  รวมถึงแต่ไม่จำกัดเพียงความถูกต้องและความเหมาะสมตามกฎหมาย
                </span>
              </p>

              <p>
                <span>
                  ท่านเข้าถึง Website นี้โดยความเสี่ยงของท่านเอง
                  เราจะใช้ความพยายามตามสมควรในการให้ข้อมูลที่ถูกต้อง
                  และข้อมูลที่ทันสมัยบน Website
                  แต่อย่างไรก็ตามท่านต้องรับความเสี่ยงเกี่ยวกับความถูกต้อง
                  และ/หรือ การใช้ และ/หรือ ในการเชื่อถือข้อมูลที่ระบุไว้บน
                  Website
                </span>
              </p>

              <p>
                <span>
                  บริษัท กรรมการ พนักงาน และลูกจ้าง จะไม่รับผิดใด ๆ
                  ไม่ว่าภายใต้สัญญา ละเมิด การประมาทเลินเล่อ
                  หรือโดยประการอื่นใดก็ตาม
                  สำหรับผลที่เกิดขึ้นไม่ว่าโดยตรงหรือโดยอ้อมจากการที่ท่านใช้
                  Website หรือในความผิดพลาดหรือตกหล่นของเนื้อหาสาระ
                  และไม่มีการให้คำรับรองหรือคำรับประกันเกี่ยวกับข้อมูลบน Website
                  อื่นใดที่สามารถเชื่อมโยงได้จาก Website นี้
                  นอกจากนี้เราไม่ให้คำรับรองหรือคำรับประกันใด ๆว่าการเข้าถึง
                  Website จะไม่มีการสะดุด หรือปราศจากความผิดพลาดหรือปราศจากไวรัส
                </span>
              </p>

              <p>
                <span>
                  Website นี้เผยแพร่เพื่อการให้ข้อมูลเป็นการทั่วไป ข้อมูล
                  เนื้อหา หรือสาระที่อยู่ใน Website ให้ไว้ตามที่ "เป็นอยู่"
                  เท่านั้นโดยไม่มีการให้คำรับรองหรือคำรับประกันใด ๆ
                  ไม่ว่าโดยชัดแจ้ง โดยนัย ตามกฎหมาย หรือโดยประการอื่นใด
                  รวมทั้งแต่ไม่จำกัดเพียงการให้คำรับรองโดยนัย
                  ซึ่งสินค้าหรือบริการดังกล่าวเป็นการทั่วไปตามที่ได้บรรยายไว้
                  และเหมาะสมตามสมควรสำหรับวัตถุประสงค์แห่งการจำหน่ายสินค้าหรือการให้บริการดังกล่าว
                  หรือความเหมาะสมสำหรับวัตถุประสงค์บางประการใดเป็นการเฉพาะของสินค้าที่ขายหรือจำหน่าย
                  หรือการให้บริการโดยเรา บริษัทที่เกี่ยวข้องและบริษัทในเครือ
                </span>
              </p>

              <p>
                <span>
                  เราจะไม่รับผิดชอบต่อท่านหรือบุคคลภายนอกไม่ว่าภายใต้สัญญา
                  ละเมิด การประมาทเลินเล่อ
                  หรือประการอื่นสำหรับความเสียหายที่เกิดขึ้นไม่ว่าโดยตรง โดยอ้อม
                  ความเสียหายพิเศษ ความเสียหาย
                  อันเป็นผลสืบเนื่องหรือความเสียหายในเชิงลงโทษที่อ้างว่าเกิดจากการเข้าสู่ระบบ
                  (รวมถึงการที่อ้างว่าได้รับ ไวรัสจาก Website นี้)
                  หรือการที่ไม่สามารถเข้าสู่ระบบ หรือเกิดจากการใช้ข้อความใน
                  Website รวมทั้ง ข้อมูล และสาระต่าง ๆ ที่แสดงบน Website
                  ที่เรามีสิทธิเชื่อมโยงหรือเข้าถึงสาระต่าง ๆ
                  จัดทำโดยบุคคลภายนอก แม้เราจะประมาทเลินเล่อก็ตาม
                  หรือถ้าหากเรารับการเตือนให้ทราบถึงความเป็นไปได้ของความเสียหาย
                  ข้อจำกัดเรื่องความรับผิดนี้จะปรับใช้กับ Website อื่น ๆ
                  ที่เชื่อมโยงกับ Website นี้ด้วย
                </span>
              </p>

              <p>
                <span>
                  หากท่านสั่งซื้อสินค้าใดๆจากทาง Website ท่านจะได้รับ e-mail
                  จากเราเพื่อเป็นการยืนยันการสั่งซื้อของท่าน
                  ซึ่งจะแสดงรายละเอียดของสินค้าที่ท่านสั่งซื้อ
                  ในกรณีที่เราไม่สามารถทำการจัดส่งสินค้าใด ๆ ให้ท่านได้
                  เราจะแจ้งให้ท่านทราบทาง e-mail เช่นกัน ทั้งนี้ การจ่ายเงินต่าง
                  ๆ จะทำโดยบริการของเรา หรือ
                  เราอาจให้บุคคลภายนอกดำเนินการเรื่องการชำระค่าสินค้า
                  โดยใช้บัตรเครดิต หลังจากท่านชำระเงินเรียบร้อยแล้ว
                  เราจะรีบดำเนินการจัดส่งใบเสร็จรับเงินพร้อมสินค้าไปยังที่อยู่ที่ท่านให้ไว้หรืออาจนำส่งใบเสร็จรับเงินให้ในภายหลัง
                </span>
              </p>

              <p>
                <span>
                  หากท่านขอใช้บริการทางการศึกษาใด ๆ จากทาง Website ท่านจะได้รับ
                  e-mail จากเราเพื่อเป็นการยืนยันการขอใช้บริการของท่าน
                  ซึ่งจะแสดงรายละเอียดของบริการที่ท่านสมัคร
                  ในกรณีที่เราไม่สามารถให้บริการทางการศึกษาใด ๆ ให้ท่านได้
                  เราจะแจ้งให้ท่านทราบทาง e-mail เช่นกัน ทั้งนี้ การจ่ายเงินต่าง
                  ๆ จะทำโดยบริการของเรา หรือ
                  เราอาจให้บุคคลภายนอกดำเนินการเรื่องการชำระค่าบริการ
                  โดยใช้บัตรเครดิต หลังจากท่านชำระเงินเรียบร้อยแล้ว
                  เราจะรีบดำเนินการจัดส่งใบเสร็จรับเงินพร้อมสินค้าไปยังที่อยู่ที่ท่านให้ไว้หรืออาจนำส่งใบเสร็จรับเงินให้ในภายหลัง
                </span>
              </p>

              <p>
                <span>
                  กรรมสิทธิ์ในสินค้าและความเสี่ยงในความสูญหาย
                  หรือเสียหายของสินค้าที่ท่านซื้อจะโอนไปยังท่านในทันทีที่สินค้าได้ถูกนำออกไปจากบริษัทเรา
                </span>
              </p>

              <p>
                <span>
                  ท่านตกลงว่าสินค้าที่ซื้อจาก Website
                  นี้มีวัตถุประสงค์เพื่อการส่วนตัวเท่านั้น ท่านจะไม่ขาย
                  หรือนำไปขายต่อซึ่งสินค้าทุกชนิด เราขอสงวนสิทธิ์ในการยกเลิก
                  หรือลดปริมาณในการสั่งซื้อสินค้า
                  ตามดุลพินิจของเราได้โดยฝ่ายเดียวที่อาจส่งผลให้เกิดการฝ่าฝืนข้อกำหนดและเงื่อนไขตามกฎหมาย
                </span>
              </p>

              <p>
                <span>
                  สำหรับนโยบายอื่นที่เกี่ยวกับการสั่งซื้อทาง Website เช่น
                  กระบวนการสั่งซื้อ การดำเนินการจัดส่ง การจัดการคืน
                  หรือเปลี่ยนสินค้า กรุณา ให้เป็นไปตามที่เรากำหนด
                </span>
              </p>

              <p>
                <span>
                  User Name และ Password ที่ให้กับสมาชิกของ Crewhitz
                  นั้นถือว่าเป็นทรัพย์สินของบริษัทเรา และห้ามสมาชิกของ Crewhitz
                  อนุญาตให้บุคคลใดใช้โดยไม่ได้รับอนุญาตจากเรา
                  และทางเราขอสงวนสิทธิในการหยุด การยกเลิก หรือบอกเลิก "User
                  Name" และ Password ตามที่เราเห็นสมควร
                </span>
              </p>

              <p>
                <span>
                  เราสงวนสิทธิในการบอกเลิกการเป็นสมาชิก Crewhitz
                  โดยทันทีที่เราพบว่าสมาชิกฉ้อโกงหรือมีเจตนาบ่อนทำลายการให้บริการต่อสมาชิก
                  และ/หรือ ข้อมูลของสมาชิก
                </span>
              </p>

              <p>
                <span>
                  ถึงแม้ว่าเรามีเจตนาจะเสนอการบริการให้แก่สมาชิกเป็นระยะยาว
                  เราขอสงวนสิทธิในการแก้ไข หรือบอกเลิกการให้บริการแก่สมาชิกใด ๆ
                  ถ้าสภาพแวดล้อมของการแข่งขันทางธุรกิจทำให้การให้บริการแก่สมาชิกหรือการให้ส่วนลดไม่สามารถทำได้
                </span>
              </p>

              <p>
                <span>
                  ท่านตกลงจะไม่ทำการนำเสนอหรือส่งต่อสาระใด ๆ ที่ผิดกฎหมาย
                  ที่เป็นการคุกคาม ใส่ร้าย การหมิ่นประมาท หยาบคาย ภาพอนาจาร
                  การดูหมิ่นต่อศาสนา หรือสาระใด ๆ
                  ที่เป็นหรือส่งเสริมความประพฤติที่อาจจะรับการพิจารณาว่าเป็นการทำความผิดทางอาญาหรือทำผิดกฎหมาย
                  เราสงวนสิทธิในการลบสาระใด ๆ ที่ต้องห้ามดังกล่าว
                </span>
              </p>

              <p>
                <span>
                  ท่านตกลงจะยอมชดใช้และปกป้องเราจากค่าเสียหายหรือค่าใช้จ่ายที่เกิดขึ้นโดยมีผลจากการที่ท่านทำผิดกฎหมายโดยไม่คำนึงว่าเป็นความเสียหายโดยตรง
                  ที่เกี่ยวโยงที่เป็นผลตามมา หรือในเชิงลงโทษ
                </span>
              </p>

              <p>
                <span>
                  เราขอสงวนสิทธิที่จะทำการเปลี่ยนแปลงข้อกำหนดและเงื่อนไขนี้โดยไม่มีการบอกกล่าว
                  ไม่ว่าในขณะใดโดยจะมีผลทันทีที่นำเสนอลงใน Website
                </span>
              </p>

              <p>
                <span>
                  ท่านตกลงว่าการใช้ Website
                  ของท่านอยู่ภายใต้บังคับและจะรับการตีความตามกฎหมายไทย
                </span>
              </p>
            </div>
          </div>
        </div>
      </Container>
    );
  }
}
