import React from "react";
import { Button, Card, CardBody, CardTitle } from "reactstrap";
import Link from "next/link";
import { Container } from "reactstrap";
import { withRouter } from "next/router";

export default class Terms extends React.Component {
  render() {
    return (
      <Container
        style={{
          maxWidth: "100%",
          paddingLeft: 0,
          paddingRight: 0,
          backgroundColor: "#fff"
        }}
      >
        <nav
          className="navbar navbar-expand-md navbar-light d-flex"
          style={{
            backgroundColor: "#171e4a",
            width: "100%",
            padding: "15px",
            marginBottom: "40px"
          }}
        >
          <div
            className="pull-left-term"
            style={{ width: "100%", marginLeft: "20px",
          }}
          >
            <a className="navbar-brand" href="#">
              <img src="/static/images/icon/icon_wh.png" alt="" width="130"  />
            </a>
          </div>
          {/* <button
            className="navbar-toggler"
            type="button"
            data-toggle="collapse"
            data-target="#navbarNavAltMarkup"
            aria-controls="navbarNavAltMarkup"
            aria-expanded="false"
            aria-label="Toggle navigation"
          >
            <span className="navbar-toggler-icon" />
          </button> */}
          <div
            className="login-btn pull-right-term"
            style={{
              display: "flex",
              alignItems: "center",
              justifyContent: "center",
              width: "30%"
            }}
          >
            <Link href="/login">
              <a
                className="btn btn-primary-term"
                style={{
                  borderColor: "#fff",
                  backgroundColor: "#171e4a",
                  marginRight: 15,
                  borderRadius: 20,
                  fontFamily: "Cloud",
                  padding: "7px 30px",
                  color: '#fff'
                }}
              >
                เข้าสู่ระบบ
              </a>
            </Link>

            <Link href="/register">
              <a
                className="btn btn-primary-term"
                href="#"
                style={{
                  borderColor: "#fff",
                  backgroundColor: "#171e4a",
                  borderRadius: 20,
                  fontFamily: "Cloud",
                  padding: "7px 30px",
                  color:'#fff'
                }}
              >
                สมัครสมาชิก
              </a>
            </Link>
          </div>
        </nav>

        <div
          style={{ display: "flex", justifyContent: "center", width: "100%" }}
        >
          <div className="row" style={{maxWidth: '70%'}}>
            <div
              className="col-md-8-term col-sm-offset-2"
            >
              <h3 style={{ textAlign: "center", fontWeight: 600 }}>
                ข้อกำหนดการใช้บริการ
              </h3>
              <p>
                <span />
              </p>
              <p>
                <span>Crewhitz</span>
                <span>
                  {" "}
                  ซึ่งต่อไปนี้จะเรียกว่า “เว็บไซต์”
                  เพื่อสนับสนุนกิจกรรมการใช้เว็บไซต์ของผู้ใช้งานจะอยู่ภายใต้เงื่อนไขและข้อตกลงนี้
                  ผู้ใช้งานจึงควรศึกษาเงื่อนไขและข้อตกลงฉบับนี้และ/หรือเงื่อนไขและข้อตกลงอื่นใดที่ได้แจ้งให้ทราบบนเว็บไซต์โดยละเอียดก่อนการเข้าใช้เว็บไซต์
                  ทั้งนี้
                  การเข้าใช้เว็บไซต์นี้ให้ถือว่าผู้ใช้งานยอมรับและตกลงที่จะปฏิบัติตามเงื่อนไขและข้อตกลงดังกล่าวทั้งหมด
                  หากผู้ใช้งานไม่ประสงค์ที่จะผูกพันตามเงื่อนไขและข้อตกลง
                  ขอความกรุณาผู้ใช้งานยุติการใช้งานเว็บไซต์นี้
                </span>
              </p>

              <p>
                <h4 style={{ fontWeight: 600 }}>
                  สิทธิ หน้าที่ และ ความรับผิดชอบของผู้ใช้งาน
                </h4>
              </p>
              <ol>
                <li>
                  <span>
                    ขอสงวนสิทธิเฉพาะผู้ใช้งานที่ลงทะเบียนเป็นสมาชิกเว็บไซต์สามารถใช้งานบริการและ/หรือร่วมทำกิจกรรมต่างๆที่จัดขึ้นในเว็บไซต์
                  </span>
                </li>
                <li>
                  <span>
                    การลงทะเบียนสมาชิกเว็บไซต์
                    ผู้ใช้งานจะต้องให้ข้อมูลส่วนบุคคลของตนเองอย่างถูกต้องสมบูรณ์
                    และตรงกับความเป็นจริง
                  </span>
                </li>
                <li>
                  <span>
                    หากมีการเปลี่ยนแปลงข้อมูลในภายหลัง
                    ผู้ใช้งานตกลงจะแก้ไขปรับปรุงข้อมูลส่วนบุคคลที่เคยระบุไว้ในข้อ
                    2 ให้ถูกต้องและตรงต่อความเป็นจริงในปัจจุบัน
                  </span>
                </li>
                <li>
                  <span>
                    ผู้ใช้งานตกลงจะรักษาอีเมลล์แอดเดรส (email address)
                    และรหัสผ่าน (password) ไว้เป็นความลับ
                    หากผู้ใช้งานมอบหรืออนุญาตให้บุคคลอื่นนำข้อมูลส่วนบุคคล
                    และ/หรืออีเมลล์แอดเดรส (email address) และรหัสผ่าน
                    (password) ดังกล่าวไปใช้เพื่อการใดๆ
                    ให้ถือว่าเป็นการกระทำโดยตัวของผู้ใช้งานเองและผู้ใช้งานจะต้องรับผิดชอบในการใด
                    ๆ ที่อาจเกิดขึ้นจากการกระทำดังกล่าวโดยสิ้นเชิง{" "}
                  </span>
                </li>
                <li>
                  <span>
                    ในกรณีผู้ใช้งานใช้สิทธิไปในทางที่ก่อให้เกิดความเสียหายต่อผู้ใช้งานอื่นใด
                    ผู้ใช้งานตกลงที่จะรับผิดชอบต่อเว็บไซต์สำหรับความเสียหายที่เกิดขึ้นจนเต็มจำนวน
                  </span>
                </li>
                <li>
                  <span>
                    ผู้ใช้งานจะไม่กระทำการที่ไม่เหมาะสม หรือไม่ถูกต้องตามกฎหมาย
                    หรือขัดต่อศีลธรรมอันดีของประชาชน
                    หรือมีเหตุอันควรเชื่อได้ว่าผู้ใช้งานอาจเข้าใช้เว็บไซต์โดยมีเจตนาทุจริต
                  </span>
                </li>
                <li>
                  <span>
                    กรณีผู้ใช้งานเป็นเด็กและเยาวชนที่มีอายุต่ำกว่า 18 ปี
                    ควรได้รับอนุญาตจากบิดา มารดา
                    หรือผู้ปกครองในการสมัครเป็นสมาชิกเว็บไซด์
                    รวมถึงการทำธุรกรรมใด ๆ
                    ที่เกี่ยวข้องกับการสั่งซื้อสินค้าออนไลน์{" "}
                  </span>
                </li>
                <li>
                  <span>
                    ข้อมูลส่วนตัวของผู้ใช้บริการถือเป็นสาระสำคัญของการสมัครเป็นสมาชิกเว็บไซต์
                    ในกรณีที่ผู้ใช้งานไม่ปฏิบัติตามข้อกำหนดในการสมัครเว็บไซต์นี้
                    เว็บไซต์มีสิทธิที่จะเพิกถอนการเป็นสมาชิกเว็บไซต์ของผู้ใช้งาน
                    และมีสิทธิระงับการให้บริการได้ทันทีโดยไม่ต้องแจ้งให้ผู้ใช้งานทราบล่วงหน้า
                    โดยเว็บไซต์ไม่ต้องรับผิดชดใช้ค่าเสียหายใด ๆ
                    ให้แก่ผู้ใช้งานทั้งสิ้น
                  </span>
                </li>
                <li>
                  <span>
                    ในกรณีที่ผู้ใช้งานไม่ปฏิบัติตามข้อกำหนดในการสมัครเว็บไซต์นี้
                    เป็นเหตุให้เว็บไซต์หรือบุคคลภายนอกได้รับความเสียหาย
                    ผู้ใช้งานตกลงจะเป็นผู้รับผิดชอบในความเสียหายที่เกิดขึ้นทั้งสิ้น
                  </span>
                </li>
              </ol>
              <p>
                <span />
              </p>

              <p>
                <h4 style={{ fontWeight: 600 }}>การจำกัดความรับผิด</h4>
              </p>
              <ol>
                <li>
                  <span>
                    เว็บไซต์ไม่รับประกันในคุณภาพ ข้อมูลภาพ
                    เนื้อหาข่าวสารที่ผู้ใช้งานรับ-ส่งผ่านระบบเครือข่ายของเว็บไซต์
                    และเว็บไซต์ไม่ต้องรับผิดชอบในความเสียหายต่อผู้ใช้งาน
                    อันเนื่องมาจากความล่าช้า ผิดพลาด ขาดตกบกพร่อง
                    หรือการขัดข้องของวงจรสื่อสารที่ใช้ในการให้บริการของเว็บไซต์แต่อย่างใด
                  </span>
                </li>
                <li>
                  <span>
                    เว็บไซต์ขอสงวนสิทธิในการไม่รับเปลี่ยนหรือคืนสินค้า
                    และไม่คืนเงินบริการไม่ว่ากรณีใด ๆทั้งสิ้น
                  </span>
                </li>
                <li>
                  <span>
                    ระบบการให้บริการ ผู้ใช้งานรับทราบและตกลงอย่างชัดแจ้งว่า
                    เว็บไซต์ไม่อาจรับประกันว่าเปิดเข้าหรือการใช้เว็บไซต์ทั้งส่วนหนึ่งส่วนใด
                    หรือทั้งหมดจะสามารถกระทำได้ตลอดเวลา รวดเร็วทันใจ
                    ปราศจากการรบกวน หรือมีข้อผิดพลาด
                    และไม่รับประกันว่าเว็บไซต์จะปราศจากไวรัส
                    ระเบิดเวลาหรือสิ่งที่ก่อความเสียหายต่อคอมพิวเตอร์อื่นใดของผู้ใช้งาน
                  </span>
                </li>
                <li>
                  <span>
                    สิทธิส่วนบุคคล ข้อมูลส่วนบุคคลของผู้ใช้งานตามข้อ 2 และ 3 (
                    หมวดสิทธิ หน้าที่ และความรับผิดชอบของผู้ใช้งาน
                    )จะอยู่ภายใต้นโยบายสิทธิส่วนบุคคลของเว็บไซต์
                  </span>
                </li>
              </ol>
              <p>
                <h4 style={{ fontWeight: 600 }}>สิทธิของเว็บไซต์ฯ</h4>
              </p>
              <ol>
                <li>
                  <span>
                    เว็บไซต์มีสิทธิในการแก้ไขเปลี่ยนแปลง
                    หรือยกเลิกข้อตกลงฉบับนี้
                    และ/หรือเงื่อนไขและข้อตกลงอื่นใดบนเว็บไซต์โดยไม่จำต้องแจ้งให้ผู้ใช้งานทราบล่วงหน้า
                  </span>
                </li>
                <li>
                  <span>
                    ผู้ใช้งานตกลงและยอมรับว่าเครื่องหมายการค้า แนวคิด
                    และรูปแบบในการนำเสนอที่พัฒนาขึ้นเพื่อใช้ในการให้บริการในเว็บไซต์นี้ถือเป็นงานที่ได้รับความคุ้มครองตามกฎหมายทรัพย์สินทางปัญญา
                    ห้ามผู้ใดทำการลอกเลียนแบบทำซ้ำหรือดัดแปลงไม่ว่าจะบางส่วนหรือทั้งหมด
                  </span>
                </li>
                <li>
                  <span>
                    เนื้อหาทั้งหมดที่แสดงในเว็บไซต์อยู่ภายใต้กฎหมายทรัพย์สินทางปัญญา
                    โดยมีเว็บไซต์เป็นเจ้าของทรัพย์สินทางปัญญาทั้งหลายที่ปรากฏอยู่บนเว็บไซต์
                    ผู้ใช้งานสามารถใช้เนื้อหาเหล่านั้นเพื่อประกอบการใช้งานเว็บไซต์เท่านั้น
                    ห้ามมิให้ผู้ใช้งานทำการลอกเลียนแบบหรือทำซ้ำเนื้อหาเหล่านั้นเพื่อใช้งานในวัตถุประสงค์อื่น{" "}
                  </span>
                </li>
                <li>
                  <span>
                    ผู้ใช้งานต้องไม่กระทำการใด ๆ
                    อันเป็นการละเมิดหรือควรเชื่อได้ว่าเป็นการละเมิดสิทธิในลิขสิทธิ์
                    เครื่องหมายการค้า สิทธิบัตร ความลับทางการค้า
                    รวมทั้งทรัพย์สินทางปัญญาอื่นตามกฎหมาย ไม่ว่าโดยวิธีการใด
                    ทั้งนี้ ไม่ว่าจะกระทำโดยมีเจตนาหรือไม่ก็ตาม
                    หากผู้ใช้งานฝ่าฝืนข้อกำหนดดังกล่าวผู้ใช้งานตกลงให้เว็บไซต์ยกเลิกการเป็นสมาชิกของผู้ใช้งานเป็นการถาวรและดำเนินคดีตามกฏหมายกับผู้กระทำผิด
                  </span>
                </li>
                <li>
                  <span>
                    กฎหมายที่ใช้บังคับ เงื่อนไข และข้อตกลงในการใช้เว็บไซต์นี้
                    และ/หรือเงื่อนไขและข้อตกลงอื่นใดที่ปรากฏบนเว็บไซต์อยู่ภายใต้บังคับแห่งกฎหมายไทย
                    และไม่อยู่ภายใต้การขัดกันแห่งกฎหมาย
                  </span>
                </li>
              </ol>

              <p>
                <span />
              </p>
            </div>
          </div>
        </div>

      </Container>
    );
  }
}
